const users = [
  { id: 1, name: "Катя", friends: [2, 3] },
  { id: 2, name: "Олексій", friends: [1] },
  { id: 3, name: "Аліна", friends: [1] },
  { id: 4, name: "Ігор", friends: [] },
  { id: 5, name: "Марина", friends: [] },
];

const posts = [
{
  id: 1,
  userId: 1,
  content: "🌿 День повного перезавантаження. Провела кілька годин на природі — без телефона, без шуму. Просто я, свіже повітря і музика в навушниках. Іноді цього більш ніж достатньо 💚 #slowday #вдячність",
  comments: [
      { id: 1, authorId: 2, text: "Дуже рада за тебе!" },
      { id: 2, authorId: 3, text: "Підтримую!" }
            ]
},
{
  userId: 1,
  content: "☕ Почала читати книгу про mindfulness — і вже ловлю себе на тому, що стала більше помічати деталі. Навіть чашка кави вранці — це не просто кава, а момент, де починається день. #усвідомленість #ранок"
},
{
  userId: 2,
  content: "💻 Новий React-проєкт запущено! Поки лише MVP, але вже кайфую від процесу. Найбільше люблю ці моменти, коли ідея стає чимось реальним. #програмістськежиття #стартап"
},
{
  userId: 2,
  content: "🍂 Прогулянка без телефону — це як міні-відпустка для мозку. Просто йшов, слухав місто, дивився вгору. Навіть на секунду забув, що щось потрібно встигати. #детокс #усвідомленість"
},
{
  userId: 3,
  content: "🧘‍♀️ Сьогодні вранці вперше спробувала йогу. Із зовні — нічого особливого. Але відчуття після — ніби тіло подякувало. Думаю, я хочу це продовжити. #йога #новийетап"
},
{
  userId: 3,
  content: "✨ Вечір на кухні, тиша і теплий чай. В такі моменти особливо хочеться подякувати собі за все, що пройшла. І просто обійняти себе. #затишок #теплоспогадів"
},
{
  userId: 4,
  content: "🏃‍♂️ 5 км — done! Біг допомагає мені перезавантажитись краще за будь-яку каву. Найкращі думки приходять саме під час руху. #ранокбігуна #марафон2025"
},
{
  userId: 5,
  content: "🧁 Чорничні мафіни за рецептом бабусі — найкраща ароматерапія у світі. Поки вони пеклись, вся квартира пахла дитинством. Ідеальний вечір. #смакдитинства #випічка"
},
];

module.exports = { users, posts };